; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 98277 2 2 2 4 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph0 - mode
	image1 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(pointing satellite1 GroundStation1)
	(have_image Star4 image1)
	(have_image Phenomenon5 image1)
	(have_image Phenomenon6 image1)
	(have_image Star7 image1)
))

)

; plan
1. (turn_to satellite0 phenomenon5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon5)
   goals met: 1 of 6
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 6
3. (turn_to satellite1 groundstation0 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation0)
   goals met: 1 of 6
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
5. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 1 of 6
6. (turn_to satellite0 star2 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star2)
   goals met: 0 of 6
7. (turn_to satellite1 star7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star7)
   goals met: 0 of 6
8. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 6
9. (take_image satellite1 star7 instrument3 image1)
   added: (have_image star7 image1)
   goals met: 1 of 6
10. (turn_to satellite0 star4 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star4)
   goals met: 1 of 6
11. (turn_to satellite1 groundstation1 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation1)
   goals met: 2 of 6
12. (take_image satellite0 star4 instrument0 image1)
   added: (have_image star4 image1)
   goals met: 3 of 6
13. (turn_to satellite0 phenomenon5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 6
14. (turn_to satellite1 phenomenon6 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon6)
   goals met: 3 of 6
15. (take_image satellite0 phenomenon5 instrument0 image1)
   added: (have_image phenomenon5 image1)
   goals met: 4 of 6
16. (take_image satellite1 phenomenon6 instrument3 image1)
   added: (have_image phenomenon6 image1)
   goals met: 5 of 6
17. (turn_to satellite1 groundstation1 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 groundstation1)
   goals met: 6 of 6
